# yolov8x_4ch.yaml

nc: 2
in_channels: 4

backbone:
  - [-1, 1, Conv, [80, 3, 2]]
  - [-1, 1, Conv, [160, 3, 2]]
  - [-1, 3, C2f, [160, True]]
  - [-1, 1, Conv, [320, 3, 2]]
  - [-1, 6, C2f, [320, True]]
  - [-1, 1, Conv, [640, 3, 2]]
  - [-1, 6, C2f, [640, True]]
  - [-1, 1, Conv, [640, 3, 2]]
  - [-1, 3, C2f, [640, True]]
  - [-1, 1, SPPF, [640, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [640]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [320]]

  - [-1, 1, Conv, [320, 3, 2]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [640]]

  - [-1, 1, Conv, [640, 3, 2]]
  - [[-1, 0], 1, Concat, [1]]
  - [-1, 3, C2f, [640]]

  - [[15, 18, 21], 1, Detect, [nc]]
